print("Калькулятор", "\nМожете начать пользование")

c = ("+", "/", "-", "*")



while True:
    a = input("Введіть дію(*, +, -, /). 0 завершити виконання:")
    if a == "0":
        print("Програма завершена")
        break
    x = float(input("Введите перше число: "))
    y = float(input("Введіть друге число: "))
    if a == "+":
        z = x+y
        print ("Сума:", z)
    elif a == "-":
        z = x-y
        print ("Різниця:", z)
    elif a == "/":
        z = x/y
        print ("Частка:", z)
    elif a == "*":
        z = x*y
        print ("Добуток:", z)  


